In [1]:
import pandas as pd
import numpy as np

In [25]:
df = pd.DataFrame(
    {'col1': [1, 2], 
     'col2': [3, 4]})
df

   col1  col2
0     1     3
1     2     4

## DataFrame.insert(loc, column, value, allow_duplicates=<no_default>)

In [26]:
df.insert(1, "newcol", [99, 99])
df

   col1  newcol  col2
0     1      99     3
1     2      99     4

In [27]:
df.insert(0, "col1", [100, 100], allow_duplicates=True)
df

   col1  col1  newcol  col2
0   100     1      99     3
1   100     2      99     4

In [28]:
df.insert(0, "col0", pd.Series([5, 6], index=[1, 2]))
df

   col0  col1  col1  newcol  col2
0   NaN   100     1      99     3
1   5.0   100     2      99     4